/*
Наличие абстракции - когда большой проект, что нужно поделить на куски , модули(большое делим на маленькие части);
Есть разные реализации ООП, в js  прототипное наследование, можно реализовать в функциональном или прототипной стиле;

Парадигмы ООП:

1 - Инкапсуляция - помешение абстракции в об, выделение внутр и внешн интерфейса; 
Внешний - с ним взаимодействуем; Внутренний - к чему не имеем доступа;
Прячем реализацию чего то внутри(модуля) - инкапсулируем;

2 - Наследование - есть животное, котик наследует свойства животного + свои уникальные;

3 - Полиморфизм - одинаковый функционал (одно имя), но реализован по разному для разных типов; 

Прототипы
*/
